Ran Plan for 2 projects:

1. dir: `terraform` workspace: `stage`
1. dir: `terraform` workspace: `prod`

### 1. dir: `terraform` workspace: `stage`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # yandex_compute_instance.node1[0] has been deleted
- resource "yandex_compute_instance" "node1" {
      - allow_stopping_for_update = true -> null
      - created_at                = "2022-05-06T21:19:56Z" -> null
      - folder_id                 = "b1g3nfj1m34nsm6diloa" -> null
      - fqdn                      = "node10.netology.cloud" -> null
      - hostname                  = "node10" -> null
      - id                        = "fhm4lh2jnrcmcpdf7h5l" -> null
      - metadata                  = {
          - "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        } -> null
      - name                      = "node-0" -> null
      - network_acceleration_type = "standard" -> null
      - platform_id               = "standard-v3" -> null
      - status                    = "running" -> null
      - zone                      = "ru-central1-a" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "fhmqcjvva307vfr3oias" -> null
          - disk_id     = "fhmqcjvva307vfr3oias" -> null
          - mode        = "READ_WRITE" -> null

          - initialize_params {
              - block_size = 4096 -> null
              - image_id   = "fd8anitv6eua45627i0e" -> null
              - name       = "root-node10" -> null
              - size       = 30 -> null
              - type       = "network-ssd" -> null
            }
        }

      - network_interface {
          - index              = 0 -> null
          - ip_address         = "192.168.101.5" -> null
          - ipv4               = true -> null
          - ipv6               = false -> null
          - mac_address        = "d0:0d:4a:c4:53:be" -> null
          - nat                = true -> null
          - nat_ip_address     = "51.250.4.186" -> null
          - nat_ip_version     = "IPV4" -> null
          - security_group_ids = [] -> null
          - subnet_id          = "e9bad5fuj1leti2an6lm" -> null
        }

      - placement_policy {}

      - resources {
          - core_fraction = 100 -> null
          - cores         = 2 -> null
          - gpus          = 0 -> null
          - memory        = 2 -> null
        }

      - scheduling_policy {
          - preemptible = false -> null
        }
    }

  # yandex_compute_instance.node2["app"] has been deleted
- resource "yandex_compute_instance" "node2" {
      - created_at                = "2022-05-06T21:19:56Z" -> null
      - folder_id                 = "b1g3nfj1m34nsm6diloa" -> null
      - fqdn                      = "fhm9bfknknhtun22h9am.auto.internal" -> null
      - hostname                  = "fhm9bfknknhtun22h9am" -> null
      - id                        = "fhm9bfknknhtun22h9am" -> null
      - metadata                  = {
          - "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        } -> null
      - network_acceleration_type = "standard" -> null
      - platform_id               = "standard-v1" -> null
      - status                    = "running" -> null
      - zone                      = "ru-central1-a" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "fhm6gcfkrganlfuut9fh" -> null
          - disk_id     = "fhm6gcfkrganlfuut9fh" -> null
          - mode        = "READ_WRITE" -> null

          - initialize_params {
              - block_size = 4096 -> null
              - image_id   = "fd8anitv6eua45627i0e" -> null
              - name       = "root-node1app" -> null
              - size       = 30 -> null
              - type       = "network-ssd" -> null
            }
        }

      - network_interface {
          - index              = 0 -> null
          - ip_address         = "192.168.101.13" -> null
          - ipv4               = true -> null
          - ipv6               = false -> null
          - mac_address        = "d0:0d:95:be:97:a5" -> null
          - nat                = true -> null
          - nat_ip_address     = "51.250.7.122" -> null
          - nat_ip_version     = "IPV4" -> null
          - security_group_ids = [] -> null
          - subnet_id          = "e9bad5fuj1leti2an6lm" -> null
        }

      - placement_policy {}

      - resources {
          - core_fraction = 100 -> null
          - cores         = 4 -> null
          - gpus          = 0 -> null
          - memory        = 4 -> null
        }

      - scheduling_policy {
          - preemptible = false -> null
        }
    }

  # yandex_compute_instance.node2["db"] has been deleted
- resource "yandex_compute_instance" "node2" {
      - created_at                = "2022-05-06T21:19:56Z" -> null
      - folder_id                 = "b1g3nfj1m34nsm6diloa" -> null
      - fqdn                      = "fhmsqhtokjjd3p8ukpun.auto.internal" -> null
      - hostname                  = "fhmsqhtokjjd3p8ukpun" -> null
      - id                        = "fhmsqhtokjjd3p8ukpun" -> null
      - metadata                  = {
          - "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        } -> null
      - network_acceleration_type = "standard" -> null
      - platform_id               = "standard-v1" -> null
      - status                    = "running" -> null
      - zone                      = "ru-central1-a" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "fhm7ge0g8ibstkllm25n" -> null
          - disk_id     = "fhm7ge0g8ibstkllm25n" -> null
          - mode        = "READ_WRITE" -> null

          - initialize_params {
              - block_size = 4096 -> null
              - image_id   = "fd8anitv6eua45627i0e" -> null
              - name       = "root-node1db" -> null
              - size       = 30 -> null
              - type       = "network-ssd" -> null
            }
        }

      - network_interface {
          - index              = 0 -> null
          - ip_address         = "192.168.101.10" -> null
          - ipv4               = true -> null
          - ipv6               = false -> null
          - mac_address        = "d0:0d:1c:d4:7b:8a" -> null
          - nat                = true -> null
          - nat_ip_address     = "51.250.13.65" -> null
          - nat_ip_version     = "IPV4" -> null
          - security_group_ids = [] -> null
          - subnet_id          = "e9bad5fuj1leti2an6lm" -> null
        }

      - placement_policy {}

      - resources {
          - core_fraction = 100 -> null
          - cores         = 4 -> null
          - gpus          = 0 -> null
          - memory        = 8 -> null
        }

      - scheduling_policy {
          - preemptible = false -> null
        }
    }

  # yandex_vpc_network.default has been deleted
- resource "yandex_vpc_network" "default" {
      - created_at = "2022-05-06T21:19:54Z" -> null
      - folder_id  = "b1g3nfj1m34nsm6diloa" -> null
      - id         = "enpseb4qoc4ak9gjet8m" -> null
      - labels     = {} -> null
      - name       = "net" -> null
      - subnet_ids = [] -> null
    }

  # yandex_vpc_subnet.default has been deleted
- resource "yandex_vpc_subnet" "default" {
      - created_at     = "2022-05-06T21:19:55Z" -> null
      - folder_id      = "b1g3nfj1m34nsm6diloa" -> null
      - id             = "e9bad5fuj1leti2an6lm" -> null
      - labels         = {} -> null
      - name           = "subnet" -> null
      - network_id     = "enpseb4qoc4ak9gjet8m" -> null
      - v4_cidr_blocks = [
          - "192.168.101.0/24",
        ] -> null
      - v6_cidr_blocks = [] -> null
      - zone           = "ru-central1-a" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.node1[0] will be created
+ resource "yandex_compute_instance" "node1" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node10.netology.cloud"
      + id                        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        }
      + name                      = "node-0"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8anitv6eua45627i0e"
              + name        = "root-node10"
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.node2["app"] will be created
+ resource "yandex_compute_instance" "node2" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        }
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8anitv6eua45627i0e"
              + name        = "root-node1app"
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.node2["db"] will be created
+ resource "yandex_compute_instance" "node2" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        }
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8anitv6eua45627i0e"
              + name        = "root-node1db"
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_vpc_network.default will be created
+ resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "net"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.default will be created
+ resource "yandex_vpc_subnet" "default" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.101.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform -w stage`
* :put_litter_in_its_place: To **delete** this plan click [here](https://3e4e-2a01-540-a5be-2c00-765d-70f9-1c19-55ec.eu.ngrok.io/lock?id=Nb3l77eo%252Ftestrepo%252Fterraform%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform -w stage`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terraform` workspace: `prod`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.node1[0] will be created
+ resource "yandex_compute_instance" "node1" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node10.netology.cloud"
      + id                        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        }
      + name                      = "node-0"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8anitv6eua45627i0e"
              + name        = "root-node10"
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 6
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.node1[1] will be created
+ resource "yandex_compute_instance" "node1" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node11.netology.cloud"
      + id                        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        }
      + name                      = "node-1"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8anitv6eua45627i0e"
              + name        = "root-node11"
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 6
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.node2["app"] will be created
+ resource "yandex_compute_instance" "node2" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        }
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8anitv6eua45627i0e"
              + name        = "root-node1app"
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.node2["db"] will be created
+ resource "yandex_compute_instance" "node2" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: fuser
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC9rackDcwZvm/J+sqLX7/qdZnNmbHenKyMdgPTfdADmzjoGDsWi5pefPg6MC1Ny+cLtp8MFVPrgxinusJNieEW+TWh0KY93c6FgUPkyAJ2uVcUI9B8nMZIjyMM1En7SJAtWZm4x1s8W4lz9+4cQpZ3Yn/nyZP/tR8T3AGD9B94O/t2zKMH0O8XiYqNgrdHkPTvarkLJLLV81Lv4XGLj6BDEjARpfwUPGkOcdzWOVYQCNmAN5dDlIqY4senukzjtKQKD/fUB2ZmqODG/5gnS6IUJNw6v1X0IgFD+fIHefbzgHiI4jgJQQaO2m7L7qsRdbEyFCpDfCiVZ89XAbX67BpvQZRseCVmkcmLAABhPjrFpdxVQfQFsSZMmT6W3hg6ygeHZd9+Hz+OVjtwDxct2yIDR71zRqIALX70YyVEYv8T24ehGyOfhE5xHZkhNwPpeBPI0oRmrdI/lAnBJUvM84KhiB5KFcoYIF2u9xmTGWr68vxBjHuc3AcnQVd0t3FBzKs= root@vagrant
            EOT
        }
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8anitv6eua45627i0e"
              + name        = "root-node1db"
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_vpc_network.default will be created
+ resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "net"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.default will be created
+ resource "yandex_vpc_subnet" "default" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.101.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform -w prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://3e4e-2a01-540-a5be-2c00-765d-70f9-1c19-55ec.eu.ngrok.io/lock?id=Nb3l77eo%252Ftestrepo%252Fterraform%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform -w prod`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
